app/Models/ProjectModel.php

SELECT *
FROM `project`
JOIN `product` ON `product`.`product_id` = `project`.`product_id`
JOIN `worker` ON `worker`.`worker_id` = `project`.`worker_id`
---
    function getData($where = false)
    {
        $relTable1 = 'product';
        $relTable2 = 'worker';

        $builder = $this->db->table($this->table);

        if ($where) $builder = $builder->where($where);

        $builder->join($relTable1, $relTable1.'.product_id = '.$this->table.'.product_id');
        $builder->join($relTable2, $relTable2.'.worker_id = '.$this->table.'.worker_id');
        $query = $builder->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM `project`
---
    public function getCount($where = false)
    {
        $builder = $this->db->table($this->table);

        if ($where) $builder = $builder->where($where);

        $query = $builder->countAllResults();