app/Models/ProsesProjectModel.php

    function getData($where = false)
    {
        $relTable1 = 'project';

        $builder = $this->db->table($this->table);

        if ($where) $builder = $builder->where($where);

        $builder->join($relTable1, $relTable1.'.project_id = '.$this->table.'.project_id');

        $query = $builder->get()->getResult();
---
SELECT *
FROM `proses_project`
JOIN `project` ON `project`.`project_id` = `proses_project`.`project_id`

    public function updateProsesProject($project_id, $data)
    {
        return $this->where('project_id', $project_id)->set($data)->update();
---
UPDATE `proses_project` SET `Konsep_Design` = 0, `Material_Preparation` = 0, `Machining` = 0, `Assy` = 0, `TrialImprove` = 0, `Delivery` = 0, `Keuangan` = 0
WHERE `project_id` = '1'