app/Models/UsersModel.php

    function getData($where = false)
    {
        $relTable = 'roles';

        $builder = $this->db->table($this->table);

        foreach ($where as $key => $value){
            $builder->where($this->table.'.'.$key, $value);
        }
        $builder->join($relTable, $relTable.'.id_role = '.$this->table.'.id_role');
        $query = $builder->get()->getResult();
---
SELECT *
FROM `users`
JOIN `roles` ON `roles`.`id_role` = `users`.`id_role`
WHERE `users`.`id_role` = 1